{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d61e9d93-2bb2-4428-bd45-bbb70f454ab2",
   "metadata": {},
   "outputs": [],
   "source": [
    "#1\n",
    "\"\"\"На вход программе подаётся число n – количество собачьих лет. Напишите программу, которая вычисляет возраст собаки в человеческих годах \n",
    "по следующему алгоритму: в течение первых двух лет собачий год равен 10.5 человеческим годам, \n",
    "после этого каждый год собаки равен 4 человеческим годам.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "d0a544a4-9075-4c15-98b8-ad87a06080af",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "25.0\n"
     ]
    }
   ],
   "source": [
    "# Напишите Ваш код здесь\n",
    "n = int(input())\n",
    "sum = 0\n",
    "for i in range(1, n+1):\n",
    "    if i <= 2:\n",
    "        sum += 10.5\n",
    "    else:\n",
    "        sum += 4\n",
    "print(sum)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "43e6d492-a3bd-4e77-863b-e4a4fc4d51db",
   "metadata": {},
   "outputs": [],
   "source": [
    "#2\n",
    "\"\"\"На вход программе подаются три строки: имя, фамилия и отчество (именно в таком порядке). Напишите программу, которая выводит инициалы человека.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "7c69d45d-119d-45cb-bc34-2704db15011c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "А. П. А.\n"
     ]
    }
   ],
   "source": [
    "# Напишите Ваш код здесь\n",
    "print(f\"{input().upper()[0]}. {input().upper()[0]}. {input().upper()[0]}.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8deabc96-a6d7-4bd1-8104-4cc020c8239d",
   "metadata": {},
   "outputs": [],
   "source": [
    "#3\n",
    "\"\"\"Используя срезы, дополните приведённый ниже код так, чтобы он вывел \n",
    "1) первые 12 символов строки\n",
    "2) последние 9 символов строки \n",
    "3) каждый 7 символ строки\n",
    "4) вывел строку в обратном порядке\n",
    "Строка: In 2010, someone paid 10k Bitcoin for two pizzas.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "378cbc04-2f1b-4d45-a2dc-5fed1d1fd90c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "In 2010, som\n",
      "o pizzas.\n",
      "0 o d i f   .\n",
      ".sazzip owt rof nioctiB k01 diap enoemos ,0102 nI\n"
     ]
    }
   ],
   "source": [
    "s = \"In 2010, someone paid 10k Bitcoin for two pizzas.\"\n",
    "# Напишите Ваш код здесь\n",
    "print(s[:12])\n",
    "print(s[-9:])\n",
    "print(s[6], s[13], s[20], s[27], s[34], s[41], s[48])\n",
    "print(s[::-1])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a04f7f6b-f936-4ec5-99df-0dd49f9e0a57",
   "metadata": {},
   "outputs": [],
   "source": [
    "#4\n",
    "\"\"\"На вход программе подаётся одно слово, записанное в нижнем регистре. Напишите программу, которая определяет, является ли оно палиндромом.\n",
    "Палиндром слово которео читается одинако слева на право и наоборот, шалаш - палиндром\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "e85c908d-4a7f-4eb4-877e-0f122a01efe7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "NO\n"
     ]
    }
   ],
   "source": [
    "# Напишите Ваш код здесь\n",
    "x = input()\n",
    "print(\"YES\" if x == x[::-1] else \"NO\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d082553f-2334-4cd8-bea0-eed13e3ed03c",
   "metadata": {},
   "outputs": [],
   "source": [
    "#5\n",
    "\"\"\"На вход программе подаётся одна строка. Напишите программу, которая выводит:\n",
    "\n",
    "1. общее количество символов в строке;\n",
    "2. исходную строку, повторённую 3 раза;\n",
    "3. первый символ строки;\n",
    "4. первые три символа строки;\n",
    "5. последние три символа строки;\n",
    "6. строку в обратном порядке;\n",
    "7. строку с удалённым первым и последним символами."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "fb8b3c0c-5227-490f-9497-e7547c589e7b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5\n",
      "123451234512345\n",
      "1\n",
      "123\n",
      "345\n",
      "54321\n",
      "234\n"
     ]
    }
   ],
   "source": [
    "# Напишите Ваш код здесь\n",
    "x = input()\n",
    "print(len(x))\n",
    "print(x*3)\n",
    "print(x[0])\n",
    "print(x[:3])\n",
    "print(x[-3:])\n",
    "print(x[::-1])\n",
    "print(x[1:-1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8d4536e7-191d-4177-8c02-cc26781136dc",
   "metadata": {},
   "outputs": [],
   "source": [
    "#6\n",
    "\"\"\"На вход программе подаётся строка текста. Напишите программу, которая разрежет её на две равные части, переставит их местами и выведет на экран.\n",
    "Если длина строки нечётная, то длина первой части должна быть на один символ больше.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "6f54d5c4-a920-4968-9335-4b369315e8f7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "45123\n"
     ]
    }
   ],
   "source": [
    "# Напишите Ваш код здесь\n",
    "x = input()\n",
    "if len(x)%2 != 0:\n",
    "    print(x[len(x)//2+1:] + x[0:len(x)//2+1])\n",
    "else:\n",
    "    print(x[len(x)//2:] + x[0:len(x)//2])\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
