{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "66cf18a4-a302-4532-b712-a63a55bfee86",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Задачи на логич операции"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5e07aaf2-efa9-4600-b689-81f5d26530bf",
   "metadata": {},
   "outputs": [],
   "source": [
    "#1\n",
    "\"\"\"Из передачи “Здоровье” Аня узнала, что рекомендуется спать хотя бы A часов в сутки, но пересыпать тоже вредно и не стоит спать более B часов.\n",
    "Сейчас Аня спит H часов в сутки. Если режим сна Ани удовлетворяет рекомендациям передачи “Здоровье”, выведите “Это нормально”. Если Аня спит менее\n",
    "A часов, выведите “Недосып”, если же более B часов, то выведите “Пересып”.\n",
    "\n",
    "Получаемое число A всегда меньше либо равно B.\n",
    "\n",
    "На вход программе в три строки подаются переменные в следующем порядке:A,B,H.\n",
    "\n",
    "Обратите внимание на регистр символов: вывод должен в точности соответствовать описанному в задании, т. е. если программа должна вывести \n",
    "\"Пересып\", выводы программы \"пересып\", \"ПЕРЕСЫП\", \"ПеРеСыП\" и другие не будут считаться верными.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "468e6a18-354f-4884-9ca5-46f85f49a2e8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Пересып\n"
     ]
    }
   ],
   "source": [
    "# Напишите Ваш код здесь\n",
    "a, b, h = int(input()), int(input()), int(input())\n",
    "if a > 0 and b > 0 and h > 0:\n",
    "    if a < h < b:\n",
    "        print(\"Это нормально\")\n",
    "    elif h < a:\n",
    "        print(\"Недосып\")\n",
    "    else:\n",
    "        print(\"Пересып\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "23ec14c0-88a7-4eed-9188-5df53ef8885f",
   "metadata": {},
   "outputs": [],
   "source": [
    "#2\n",
    "\"\"\"Требуется определить, является ли данный год високосным. Напомним, что високосными годами считаются те годы, порядковый \n",
    "номер которых либо кратен 4, но при этом не кратен 100, либо кратен 400 (например, 2000-й год являлся високосным, а 2100-й будет невисокосным годом).\n",
    "\n",
    "Программа должна корректно работать на числах 1900≤n≤3000.\n",
    "\n",
    "Выведите \"Високосный\" в случае, если считанный год является високосным и\"Обычный\" в обратном случае \n",
    "(не забывайте проверять регистр выводимых программой символов).\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "60e1014e-7d69-4748-9cfd-d2545d851eb3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Високосный\n"
     ]
    }
   ],
   "source": [
    "# Напишите Ваш код здесь\n",
    "n = int(input())\n",
    "print(\"Високосный\" if (n % 4 == 0 and n % 100 != 0) or (n % 400 == 0) else \"Обычный\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9e42c944-ce9c-481e-be3c-1d9b0bb9022d",
   "metadata": {},
   "outputs": [],
   "source": [
    "#3\n",
    "\"\"\"Жители страны Малевии часто экспериментируют с планировкой комнат. Комнаты бывают треугольные, прямоугольные и круглые. \n",
    "Чтобы быстро вычислять жилплощадь, требуется написать программу, на вход которой подаётся тип фигуры комнаты и \n",
    "соответствующие параметры, которая бы выводила площадь получившейся комнаты. Для числа π в стране Малевии используют значение 3.14.\n",
    "Формула Герона для нахождения площади треугльника: (p*(p - a)*(p - b)*(p - c)) ** (1/2)\n",
    "\n",
    "Формат ввода данных:\n",
    "треугольник\n",
    "a\n",
    "b\n",
    "c\n",
    "____________\n",
    "прямоугольник\n",
    "a\n",
    "b\n",
    "____________\n",
    "круг\n",
    "r\n",
    "____________\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dc557942-8d5a-47d0-b8c0-0ad80fbf61d2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "314.0\n"
     ]
    }
   ],
   "source": [
    "# Напишите Ваш код здесь\n",
    "match input():\n",
    "    case \"треугольник\":\n",
    "        a, b, c = int(input()), int(input()), int(input())\n",
    "        p = (a+b+c)/2\n",
    "        print((p*(p-a)*(p-b)*(p-c)) ** (1/2))\n",
    "    case \"прямоугольник\":\n",
    "        a, b = int(input()), int(input())\n",
    "        print(a*b)\n",
    "    case \"круг\":\n",
    "        r = int(input())\n",
    "        print(3.14*(r**2))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3a239036-3531-420c-a453-31034beb7116",
   "metadata": {},
   "outputs": [],
   "source": [
    "#4\n",
    "\"\"\"Напишите программу, которая получает на вход три целых числа, по одному числу в строке, и выводит на консоль в три строки сначала максимальное,\n",
    "потом минимальное, после чего оставшееся число. На ввод могут подаваться и повторяющиеся числа.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "31bfa398-bdc5-4eed-82b7-7f97d5148bf4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20\n",
      "50\n",
      "30\n"
     ]
    }
   ],
   "source": [
    "# Напишите Ваш код здесь\n",
    "x = [int(input()), int(input()), int(input())]\n",
    "x = sorted(x)\n",
    "print(f\"{x[2]}\\n{x[0]}\\n{x[1]}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "a899710b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "50\n",
      "10\n",
      "20\n"
     ]
    }
   ],
   "source": [
    "x = [int(input()), int(input()), int(input())]\n",
    "print(max(x))\n",
    "x.remove(max(x))\n",
    "print(min(x))\n",
    "x.remove(min(x))\n",
    "print(x[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2c104056-87b3-409e-8d09-2ebbcce304cb",
   "metadata": {},
   "outputs": [],
   "source": [
    "#5\n",
    "\"\"\"Паша очень любит кататься на общественном транспорте, а получая билет, сразу проверяет, счастливый ли ему попался. Билет считается счастливым, \n",
    "если сумма первых трех цифр совпадает с суммой последних трех цифр номера билета. Однако Паша очень плохо считает в уме, поэтому попросил вас \n",
    "написать программу, которая проверит равенство сумм и выведет \"Счастливый\", если суммы совпадают, и \"Обычный\", если суммы различны.\n",
    "\n",
    "На вход программе подаётся строка из шести цифр. Выводить нужно только слово \"Счастливый\" или \"Обычный\", с большой буквы без кавычек.\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "210d30f9-f801-4808-9c92-898321d3ff84",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Обычный\n"
     ]
    }
   ],
   "source": [
    "# Напишите Ваш код здесь\n",
    "w = input()\n",
    "print(\"Счастливый\" if sum([int(i) for i in w[:3]]) == sum([int(i) for i in w[3:]]) else \"Обычный\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
